In [1]:
import sys
import polars as pl
import plotly.express as px
sys.path.insert(0, '..')
from scripts import sql, show

In [2]:
# first 5 rows of patients table
df = sql("SELECT * from hosp.patients")
show(df, limit=True)

,subject_id,gender,anchor_age,anchor_year,anchor_year_group,dod
0,10000032,F,52,2180,2014 - 2016,2180-09-09
1,10000048,F,23,2126,2008 - 2010,NaT
2,10000058,F,33,2168,2020 - 2022,NaT
3,10000068,F,19,2160,2008 - 2010,NaT
4,10000084,M,72,2160,2017 - 2019,2161-02-13
...,...,...,...,...,...,...
364622,19999828,F,46,2147,2017 - 2019,NaT
364623,19999829,F,28,2186,2008 - 2010,NaT
364624,19999840,M,58,2164,2008 - 2010,2164-09-17
364625,19999914,F,49,2158,2017 - 2019,NaT
364626,19999987,F,57,2145,2011 - 2013,NaT

In [3]:
# Anzahl Patienten, Aufenthalte
sql("""
SELECT COUNT(DISTINCT subject_id) AS patients,
       COUNT(DISTINCT hadm_id) AS admissions
FROM hosp.admissions;

""")

shape: (1, 2)
┌──────────┬────────────┐
│ patients ┆ admissions │
│ ---      ┆ ---        │
│ i64      ┆ i64        │
╞══════════╪════════════╡
│ 223452   ┆ 546028     │
└──────────┴────────────┘

In [4]:
age_range = sql("""SELECT max(anchor_age) as max_age,
                     min(anchor_age) as min_age,
                     AVG(anchor_age) as avg_age
                from hosp.patients;""")
show(age_range)

   max_age  min_age    avg_age
0       91       18  48.875097